#### Tutorial 03-Dealing with NULL Values

In databases, NULL values represent missing or undefined data. When working with datasets, you often need to handle NULL values by updating them, either by replacing them with specific values or calculating the missing data based on available information.

**NOTE**: NULL is not the same as an empty string or zero. It signifies the absence of a value.

**Approaches for Handling NULL Values**
There are ways you might handle missing values depending on the use case:
- **Update Values**: If the data source is contactable, you can update `NULL` values with new or corrected information.
- **Data Imputation**: If you need to replace missing data based on the overall dataset (such as using the average or median values), you can calculate those first and then apply them.
- **Leaving NULLs**: Sometimes it's best to leave NULL values in place and handle them in the application layer.

---
**Identifying `NULL` Values**
To check for `NULL` values in SQL, you can use the IS `NULL` condition in your queries. This condition helps you find rows where a column contains `NULL` instead of a valid value.

**Example 1**: Checking for NULL Values
To identify rows where a column has a NULL value in the participants table.

---
**UPDATE: Updating NULL Values**
You may want to update `NULL` values with a specific value. The `UPDATE` statement is used to modify existing records in a table, including updating NULL values.

**Example 2**: Update `NULL` values of two participants from Bhutan using new information. 

---
**COALESCE: Replacing NULL with a Default Value**

The COALESCE() function allows you to replace NULL values with a default value, making it useful when you want to ensure that NULL values are substituted with something more meaningful or practical in your results.

**Example 3**: Replace NULL Country with 'Myanmar'

In [7]:
import sqlite3
import pandas as pd

db_path = '../Projects/database/mmdt.db3'

# Update this code to find the participants where the value of the country is NULL.

query = """SELECT * from participants 
            WHERE BOD is NULL;
        """

df = pd.read_sql_query(query, f"sqlite:///{db_path}")
df

,ID,Time,Selected,BOD,City,State_Region,Country,Date_Leave_Country,Gender,Current_Situation,...,Device_used,School_Name,Academic_career,Pre_Knowledge_Data,Course_Wish_Join,Dedicate_Learning_Time,Personal_Professional_Goals,Reason_Right_Person,Personal_Professional_Challenges,Others
0,mmdt2024.082,None,None,None,None,None,Bhutan,None,None,None,...,None,None,None,None,None,None,None,None,None,None
1,mmdt2024.085,None,None,None,None,None,Bhutan,None,None,None,...,None,None,None,None,None,None,None,None,None,None

In [8]:
update_query = """
                UPDATE participants 
                SET Country = "Bhutan" 
                WHERE COUNTRY is NULL;
            """

conn = sqlite3.connect(db_path)
cursor = conn.cursor()
cursor.execute(update_query)
conn.commit()
conn.close()

# extract the information of the last 20 participants (ID 80 to 100) 
query = """SELECT * FROM participants;
            
        """

df = pd.read_sql_query(query, f"sqlite:///{db_path}")

In [9]:
# Update the query below to select ID, BOD, and country of the participants. Replace the null value in BOD is 2000.
# Limit your result to the last 20 participants

query = """SELECT ID
        FROM participants;
        """

df = pd.read_sql_query(query, f"sqlite:///{db_path}")
df

              ID
0   mmdt2024.001
1   mmdt2024.002
2   mmdt2024.003
3   mmdt2024.004
4   mmdt2024.005
..           ...
95  mmdt2024.096
96  mmdt2024.097
97  mmdt2024.098
98  mmdt2024.099
99  mmdt2024.100

[100 rows x 1 columns]